adamkondraciuk/hal_nordic/nrfx/mdk/nrf5002.h
typedef struct {                                /*!< (@ 0x40001000) OSCILLATORS Structure                                      */
  __IM  uint32_t  RESERVED[353];
  __IOM uint32_t  ATECLOCK;                     /*!< (@ 0x00000584) Analog test bus control for clock modules                  */
  __IM  uint32_t  RESERVED1[30];
  __IOM uint32_t  BYPASSHFXOSC;                 /*!< (@ 0x00000600) Enable or disable bypass of HFCLK crystal oscillator
                                                                    with external clock source                                 */
  __IM  uint32_t  RESERVED2[31];
  __IOM OSCILLATORS_PLL64M_Type PLL64M;         /*!< (@ 0x00000680) Unspecified                                                */
} NRF_OSCILLATORS_Type;                         /*!< Size = 1684 (0x694)                                                       */



/* =========================================================================================================================== */
/* ================                                        REGULATORS                                         ================ */
/* =========================================================================================================================== */


/**
  * @brief Regulator control (REGULATORS)
  */

typedef struct {                                /*!< (@ 0x40001000) REGULATORS Structure                                       */
  __IM  uint32_t  RESERVED[269];
  __OM  uint32_t  DISABLEHPBOR;                 /*!< (@ 0x00000434) Enable or disable HPBOR                                    */
  __IM  uint32_t  RESERVED1[50];
  __OM  uint32_t  SYSTEMOFF;                    /*!< (@ 0x00000500) System OFF register                                        */
  __IM  uint32_t  RESERVED2[2];
  __IM  uint32_t  POFSTAT;                      /*!< (@ 0x0000050C) Power-fail comparator status register                      */
  __IOM uint32_t  POFCON;                       /*!< (@ 0x00000510) Power-fail comparator configuration                        */
  __OM  uint32_t  IGNOREDAPCPWRREGMODE;         /*!< (@ 0x00000514) Ignore DAPCP power mode                                    */
  __IOM uint32_t  RSTVTHTRIM;                   /*!< (@ 0x00000518) Threshold trim, power-on reset                             */
  __IM  uint32_t  RESERVED3;
  __IOM uint32_t  BGREFTRIM;                    /*!< (@ 0x00000520) Master bias bandgap trim                                   */
  __IM  uint32_t  RESERVED4[25];
  __IOM uint32_t  ATEPOWER;                     /*!< (@ 0x00000588) Analog test bus control for power modules                  */
  __IOM uint32_t  VREFULPTRIM;                  /*!< (@ 0x0000058C) Trim value of VREF_ULP                                     */
  __IM  uint32_t  RESERVED5[22];
  __IOM uint32_t  FORCEVBUSDET;                 /*!< (@ 0x000005E8) Force VBUS detection indication                            */
  __IM  uint32_t  RESERVED6[197];
  __IOM REGULATORS_VREGANA_Type VREGANA;        /*!< (@ 0x00000900) Unspecified                                                */
  __IM  uint32_t  RESERVED7[47];
  __IOM REGULATORS_VREGMAIN_Type VREGMAIN;      /*!< (@ 0x00000A00) Unspecified                                                */
  __IM  uint32_t  RESERVED8[302];
  __OM  uint32_t  DISABLEPACSYSTEMOFFACK;       /*!< (@ 0x00000EE4) Enable or disable System OFF ack from PAC                  */
  __OM  uint32_t  DISABLESRAMSYSTEMOFFACK;      /*!< (@ 0x00000EE8) Enable or disable System OFF ack from SRAM                 */
  __OM  uint32_t  DISABLENVMSYSTEMOFFACK;       /*!< (@ 0x00000EEC) Enable or disable System OFF ack from NVM                  */
} NRF_REGULATORS_Type;                          /*!< Size = 3824 (0xef0)                                                       */



/* =========================================================================================================================== */
/* ================                                           RADIO                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief 2.4 GHz radio (RADIO)
  */

typedef struct {                                /*!< (@ 0x40002000) RADIO Structure                                            */
  __OM  uint32_t  TASKS_TXEN;                   /*!< (@ 0x00000000) Enable RADIO in TX mode                                    */
  __OM  uint32_t  TASKS_RXEN;                   /*!< (@ 0x00000004) Enable RADIO in RX mode                                    */
  __OM  uint32_t  TASKS_START;                  /*!< (@ 0x00000008) Start RADIO                                                */
  __OM  uint32_t  TASKS_STOP;                   /*!< (@ 0x0000000C) Stop RADIO                                                 */
  __OM  uint32_t  TASKS_DISABLE;                /*!< (@ 0x00000010) Disable RADIO                                              */
  __OM  uint32_t  TASKS_RSSISTART;              /*!< (@ 0x00000014) Start the RSSI and take one single sample of
                                                                    the receive signal strength                                */
  __OM  uint32_t  TASKS_RSSISTOP;               /*!< (@ 0x00000018) Stop the RSSI measurement                                  */
  __OM  uint32_t  TASKS_BCSTART;                /*!< (@ 0x0000001C) Start the bit counter                                      */
  __OM  uint32_t  TASKS_BCSTOP;                 /*!< (@ 0x00000020) Stop the bit counter                                       */
  __IM  uint32_t  RESERVED[5];
  __OM  uint32_t  TASKS_CNTP_START;             /*!< (@ 0x00000038) Start packet counter                                       */
  __OM  uint32_t  TASKS_CNTP_STOP;              /*!< (@ 0x0000003C) Stop packet counter                                        */
  __OM  uint32_t  TASKS_CNTP_CLEAR;             /*!< (@ 0x00000040) Clear packet counter                                       */
  __OM  uint32_t  TASKS_DFESTART;               /*!< (@ 0x00000044) Start an AoA/AoD procedure (antenna switching
                                                                    and baseband sampling)                                     */
  __OM  uint32_t  TASKS_DFESTOP;                /*!< (@ 0x00000048) Stop an AoA/AoD procedure                                  */
  __IM  uint32_t  RESERVED1;
  __OM  uint32_t  TASKS_DMA_START;              /*!< (@ 0x00000050) Start DMA transaction                                      */
  __OM  uint32_t  TASKS_DMA_STOP;               /*!< (@ 0x00000054) Stop ongoing DMA transaction                               */
  __IM  uint32_t  RESERVED2[2];
  __OM  uint32_t  TASKS_ACQSTART;               /*!< (@ 0x00000060) Start data acquisition                                     */
  __OM  uint32_t  TASKS_ACQSTOP;                /*!< (@ 0x00000064) Stop data acquisition                                      */
  __OM  uint32_t  TASKS_PCGC_PCP2_ZERO;         /*!< (@ 0x00000068) Zero penalty                                               */
  __OM  uint32_t  TASKS_PCGC_PCP2_FULL;         /*!< (@ 0x0000006C) Full penalty                                               */
  __OM  uint32_t  TASKS_PCGC_PCP1_ZERO;         /*!< (@ 0x00000070) Zero penalty                                               */
  __OM  uint32_t  TASKS_PCGC_PCP1_FULL;         /*!< (@ 0x00000074) Full penalty                                               */
  __OM  uint32_t  TASKS_PCGC_PCP0_ZERO;         /*!< (@ 0x00000078) Zero penalty                                               */
  __OM  uint32_t  TASKS_PCGC_PCP0_FULL;         /*!< (@ 0x0000007C) Full penalty                                               */
  __IOM uint32_t  SUBSCRIBE_TXEN;               /*!< (@ 0x00000080) Subscribe configuration for task TXEN                      */
  __IOM uint32_t  SUBSCRIBE_RXEN;               /*!< (@ 0x00000084) Subscribe configuration for task RXEN                      */
  __IOM uint32_t  SUBSCRIBE_START;              /*!< (@ 0x00000088) Subscribe configuration for task START                     */
  __IOM uint32_t  SUBSCRIBE_STOP;               /*!< (@ 0x0000008C) Subscribe configuration for task STOP                      */
  __IOM uint32_t  SUBSCRIBE_DISABLE;            /*!< (@ 0x00000090) Subscribe configuration for task DISABLE                   */
  __IOM uint32_t  SUBSCRIBE_RSSISTART;          /*!< (@ 0x00000094) Subscribe configuration for task RSSISTART                 */
  __IOM uint32_t  SUBSCRIBE_RSSISTOP;           /*!< (@ 0x00000098) Subscribe configuration for task RSSISTOP                  */
  __IOM uint32_t  SUBSCRIBE_BCSTART;            /*!< (@ 0x0000009C) Subscribe configuration for task BCSTART                   */
  __IOM uint32_t  SUBSCRIBE_BCSTOP;             /*!< (@ 0x000000A0) Subscribe configuration for task BCSTOP                    */
  __IM  uint32_t  RESERVED3[5];
  __IOM uint32_t  SUBSCRIBE_CNTP_START;         /*!< (@ 0x000000B8) Subscribe configuration for task CNTP_START                */
  __IOM uint32_t  SUBSCRIBE_CNTP_STOP;          /*!< (@ 0x000000BC) Subscribe configuration for task CNTP_STOP                 */
  __IOM uint32_t  SUBSCRIBE_CNTP_CLEAR;         /*!< (@ 0x000000C0) Subscribe configuration for task CNTP_CLEAR                */
  __IOM uint32_t  SUBSCRIBE_DFESTART;           /*!< (@ 0x000000C4) Subscribe configuration for task DFESTART                  */
  __IOM uint32_t  SUBSCRIBE_DFESTOP;            /*!< (@ 0x000000C8) Subscribe configuration for task DFESTOP                   */
  __IM  uint32_t  RESERVED4;
  __IOM uint32_t  SUBSCRIBE_DMA_START;          /*!< (@ 0x000000D0) Subscribe configuration for task DMA_START                 */
  __IOM uint32_t  SUBSCRIBE_DMA_STOP;           /*!< (@ 0x000000D4) Subscribe configuration for task DMA_STOP                  */
  __IM  uint32_t  RESERVED5[2];
  __IOM uint32_t  SUBSCRIBE_ACQSTART;           /*!< (@ 0x000000E0) Subscribe configuration for task ACQSTART                  */
  __IOM uint32_t  SUBSCRIBE_ACQSTOP;            /*!< (@ 0x000000E4) Subscribe configuration for task ACQSTOP                   */
  __IOM uint32_t  SUBSCRIBE_PCGC_PCP2_ZERO;     /*!< (@ 0x000000E8) Subscribe configuration for task PCGC_PCP2_ZERO            */
  __IOM uint32_t  SUBSCRIBE_PCGC_PCP2_FULL;     /*!< (@ 0x000000EC) Subscribe configuration for task PCGC_PCP2_FULL            */
  __IOM uint32_t  SUBSCRIBE_PCGC_PCP1_ZERO;     /*!< (@ 0x000000F0) Subscribe configuration for task PCGC_PCP1_ZERO            */
  __IOM uint32_t  SUBSCRIBE_PCGC_PCP1_FULL;     /*!< (@ 0x000000F4) Subscribe configuration for task PCGC_PCP1_FULL            */
  __IOM uint32_t  SUBSCRIBE_PCGC_PCP0_ZERO;     /*!< (@ 0x000000F8) Subscribe configuration for task PCGC_PCP0_ZERO            */
  __IOM uint32_t  SUBSCRIBE_PCGC_PCP0_FULL;     /*!< (@ 0x000000FC) Subscribe configuration for task PCGC_PCP0_FULL            */
  __IOM uint32_t  EVENTS_READY;                 /*!< (@ 0x00000100) RADIO has ramped up and is ready to be started             */
  __IOM uint32_t  EVENTS_ADDRESS;               /*!< (@ 0x00000104) Address sent or received                                   */
  __IOM uint32_t  EVENTS_PAYLOAD;               /*!< (@ 0x00000108) Packet payload sent or received                            */
  __IOM uint32_t  EVENTS_END;                   /*!< (@ 0x0000010C) Packet sent or received                                    */
  __IOM uint32_t  EVENTS_DISABLED;              /*!< (@ 0x00000110) RADIO has been disabled                                    */
  __IOM uint32_t  EVENTS_DEVMATCH;              /*!< (@ 0x00000114) A device address match occurred on the last received
                                                                    packet                                                     */
  __IOM uint32_t  EVENTS_DEVMISS;               /*!< (@ 0x00000118) No device address match occurred on the last
                                                                    received packet                                            */
  __IOM uint32_t  EVENTS_RSSIEND;               /*!< (@ 0x0000011C) Sampling of receive signal strength complete               */
  __IM  uint32_t  RESERVED6[2];
  __IOM uint32_t  EVENTS_BCMATCH;               /*!< (@ 0x00000128) Bit counter reached bit count value                        */
  __IOM uint32_t  EVENTS_CTEEND;                /*!< (@ 0x0000012C) End of CTE                                                 */
  __IOM uint32_t  EVENTS_CRCOK;                 /*!< (@ 0x00000130) Packet received with CRC ok                                */
  __IOM uint32_t  EVENTS_CRCERROR;              /*!< (@ 0x00000134) Packet received with CRC error                             */
  __IM  uint32_t  RESERVED7[7];
  __IOM uint32_t  EVENTS_TXREADY;               /*!< (@ 0x00000154) RADIO has ramped up and is ready to be started
                                                                    TX path                                                    */
  __IOM uint32_t  EVENTS_RXREADY;               /*!< (@ 0x00000158) RADIO has ramped up and is ready to be started
                                                                    RX path                                                    */
  __IOM uint32_t  EVENTS_MHRMATCH;              /*!< (@ 0x0000015C) MAC header match found                                     */
  __IOM uint32_t  EVENTS_ACQEND;                /*!< (@ 0x00000160) ACQDMA EasyDMA buffer full                                 */
  __IOM uint32_t  EVENTS_ACQREADY;              /*!< (@ 0x00000164) ACQDMA EasyDMA sample ready                                */
  __IM  uint32_t  RESERVED8;
  __IOM uint32_t  EVENTS_PHYEND;                /*!< (@ 0x0000016C) Generated when last bit is sent on air, or received
                                                                    from air                                                   */
  __IOM uint32_t  EVENTS_CTEPRESENT;            /*!< (@ 0x00000170) CTE is present (early warning right after receiving
                                                                    CTEInfo byte)                                              */
  __IOM uint32_t  EVENTS_CTEWARNING;            /*!< (@ 0x00000174) CTE is present, but CTEType or CTETime is out
                                                                    of valid range (early warning right after
                                                                    receiving CTEinfo byte)                                    */
  __IOM uint32_t  EVENTS_DFEEND;                /*!< (@ 0x00000178) When both antenna switching AND direction finding
                                                                    sampling have completed                                    */
  __IM  uint32_t  RESERVED9;
  __IOM uint32_t  PUBLISH_READY;                /*!< (@ 0x00000180) Publish configuration for event READY                      */
  __IOM uint32_t  PUBLISH_ADDRESS;              /*!< (@ 0x00000184) Publish configuration for event ADDRESS                    */
  __IOM uint32_t  PUBLISH_PAYLOAD;              /*!< (@ 0x00000188) Publish configuration for event PAYLOAD                    */
  __IOM uint32_t  PUBLISH_END;                  /*!< (@ 0x0000018C) Publish configuration for event END                        */
  __IOM uint32_t  PUBLISH_DISABLED;             /*!< (@ 0x00000190) Publish configuration for event DISABLED                   */
  __IOM uint32_t  PUBLISH_DEVMATCH;             /*!< (@ 0x00000194) Publish configuration for event DEVMATCH                   */
  __IOM uint32_t  PUBLISH_DEVMISS;              /*!< (@ 0x00000198) Publish configuration for event DEVMISS                    */
  __IOM uint32_t  PUBLISH_RSSIEND;              /*!< (@ 0x0000019C) Publish configuration for event RSSIEND                    */
  __IM  uint32_t  RESERVED10[2];
  __IOM uint32_t  PUBLISH_BCMATCH;              /*!< (@ 0x000001A8) Publish configuration for event BCMATCH                    */
  __IOM uint32_t  PUBLISH_CTEEND;               /*!< (@ 0x000001AC) Publish configuration for event CTEEND                     */
  __IOM uint32_t  PUBLISH_CRCOK;                /*!< (@ 0x000001B0) Publish configuration for event CRCOK                      */
  __IOM uint32_t  PUBLISH_CRCERROR;             /*!< (@ 0x000001B4) Publish configuration for event CRCERROR                   */
  __IM  uint32_t  RESERVED11[7];
  __IOM uint32_t  PUBLISH_TXREADY;              /*!< (@ 0x000001D4) Publish configuration for event TXREADY                    */
  __IOM uint32_t  PUBLISH_RXREADY;              /*!< (@ 0x000001D8) Publish configuration for event RXREADY                    */
  __IOM uint32_t  PUBLISH_MHRMATCH;             /*!< (@ 0x000001DC) Publish configuration for event MHRMATCH                   */
  __IOM uint32_t  PUBLISH_ACQEND;               /*!< (@ 0x000001E0) Publish configuration for event ACQEND                     */
  __IOM uint32_t  PUBLISH_ACQREADY;             /*!< (@ 0x000001E4) Publish configuration for event ACQREADY                   */
  __IM  uint32_t  RESERVED12;
  __IOM uint32_t  PUBLISH_PHYEND;               /*!< (@ 0x000001EC) Publish configuration for event PHYEND                     */
  __IOM uint32_t  PUBLISH_CTEPRESENT;           /*!< (@ 0x000001F0) Publish configuration for event CTEPRESENT                 */
  __IOM uint32_t  PUBLISH_CTEWARNING;           /*!< (@ 0x000001F4) Publish configuration for event CTEWARNING                 */
  __IOM uint32_t  PUBLISH_DFEEND;               /*!< (@ 0x000001F8) Publish configuration for event DFEEND                     */
  __IM  uint32_t  RESERVED13;
  __IOM uint32_t  SHORTS;                       /*!< (@ 0x00000200) Shortcuts between local events and tasks                   */
  __IM  uint32_t  RESERVED14[64];
  __IOM uint32_t  INTENSET;                     /*!< (@ 0x00000304) Enable interrupt                                           */
  __IOM uint32_t  INTENCLR;                     /*!< (@ 0x00000308) Disable interrupt                                          */
  __IM  uint32_t  RESERVED15[61];
  __IM  uint32_t  CRCSTATUS;                    /*!< (@ 0x00000400) CRC status                                                 */
  __IM  uint32_t  RESERVED16;
  __IM  uint32_t  RXMATCH;                      /*!< (@ 0x00000408) Received address                                           */
  __IM  uint32_t  RXCRC;                        /*!< (@ 0x0000040C) CRC field of previously received packet                    */
  __IM  uint32_t  DAI;                          /*!< (@ 0x00000410) Device address match index                                 */
  __IM  uint32_t  PDUSTAT;                      /*!< (@ 0x00000414) Payload status                                             */
  __IM  uint32_t  DMA_STAT;                     /*!< (@ 0x00000418) DMA byte count                                             */
  __IM  uint32_t  RESERVED17;
  __IM  uint32_t  PLL_CAL_VCO;                  /*!< (@ 0x00000420) PLL Calibration                                            */
  __IM  uint32_t  LNB_OUT_SPI;                  /*!< (@ 0x00000424) Readout of gain settings set by the AGC. They
                                                                    are sampled at EVENTS_ADDRESS and when triggering
                                                                    TASKS_RSSISTART                                            */
  __IM  uint32_t  RESERVED18[2];
  __IM  uint32_t  MISC_CAL_OUT1;                /*!< (@ 0x00000430) Misc cal readouts                                          */
  __IM  uint32_t  MISC_CAL_OUT2;                /*!< (@ 0x00000434) Misc cal readouts                                          */
  __IM  uint32_t  RESERVED19[2];
  __IM  uint32_t  CFO_STAT;                     /*!< (@ 0x00000440) Carrier freq. offset estimate                              */
  __IM  uint32_t  IQCAL_OUT;                    /*!< (@ 0x00000444) Test: IandQ gain/phase mismatch calibration values
                                                                    out                                                        */
  __IM  uint32_t  PBCAL_OUT;                    /*!< (@ 0x00000448) Test: PB calibration values out                            */
  __IM  uint32_t  CTESTATUS;                    /*!< (@ 0x0000044C) CTEInfo parsed from received packet                        */
  __IOM uint32_t  HYPSTDCHECKSTAT;              /*!< (@ 0x00000450) Address Check Override                                     */
  __IOM uint32_t  HYPSTDAADIFFVEC;              /*!< (@ 0x00000454) Address Diff Vector                                        */
  __IM  uint32_t  DFESTATUS;                    /*!< (@ 0x00000458) DFE status information                                     */
  __IM  uint32_t  RESERVED20[42];
  __IOM uint32_t  PACKETPTR;                    /*!< (@ 0x00000504) Packet pointer                                             */
  __IOM uint32_t  FREQUENCY;                    /*!< (@ 0x00000508) Frequency                                                  */
  __IOM uint32_t  TXPOWER;                      /*!< (@ 0x0000050C) Output power                                               */
  __IOM uint32_t  MODE;                         /*!< (@ 0x00000510) Data rate and modulation                                   */
  __IOM uint32_t  PCNF0;                        /*!< (@ 0x00000514) Packet configuration register 0                            */
  __IOM uint32_t  PCNF1;                        /*!< (@ 0x00000518) Packet configuration register 1                            */
  __IOM uint32_t  BASE0;                        /*!< (@ 0x0000051C) Base address 0                                             */
  __IOM uint32_t  BASE1;                        /*!< (@ 0x00000520) Base address 1                                             */
  __IOM uint32_t  PREFIX0;                      /*!< (@ 0x00000524) Prefixes bytes for logical addresses 0-3                   */
  __IOM uint32_t  PREFIX1;                      /*!< (@ 0x00000528) Prefixes bytes for logical addresses 4-7                   */
  __IOM uint32_t  TXADDRESS;                    /*!< (@ 0x0000052C) Transmit address select                                    */
  __IOM uint32_t  RXADDRESSES;                  /*!< (@ 0x00000530) Receive address select                                     */
  __IOM uint32_t  CRCCNF;                       /*!< (@ 0x00000534) CRC configuration                                          */
  __IOM uint32_t  CRCPOLY;                      /*!< (@ 0x00000538) CRC polynomial                                             */
  __IOM uint32_t  CRCINIT;                      /*!< (@ 0x0000053C) CRC initial value                                          */
  __IM  uint32_t  RESERVED21;
  __IOM uint32_t  TIFS;                         /*!< (@ 0x00000544) Interframe spacing in us                                   */
  __IM  uint32_t  RSSISAMPLE;                   /*!< (@ 0x00000548) RSSI sample                                                */
  __IOM uint32_t  RSSI_CONFIG;                  /*!< (@ 0x0000054C) RSSI resolution                                            */
  __IM  uint32_t  STATE;                        /*!< (@ 0x00000550) Current radio state                                        */
  __IOM uint32_t  DATAWHITEIV;                  /*!< (@ 0x00000554) Data whitening initial value                               */
  __IM  uint32_t  RESERVED22;
  __IOM uint32_t  DMA_MAXLEN;                   /*!< (@ 0x0000055C) DMA max length                                             */
  __IOM uint32_t  BCC;                          /*!< (@ 0x00000560) Bit counter compare                                        */
  __IM  uint32_t  RESERVED23;
