adamkondraciuk/hal_nordic/nrfx/mdk/nrf5002.h
typedef struct {                                /*!< (@ 0x40017000) EGU0 Structure                                             */
  __OM  uint32_t  TASKS_TRIGGER[16];            /*!< (@ 0x00000000) Description collection: Trigger n for triggering
                                                                    the corresponding TRIGGERED[n] event                       */
  __IM  uint32_t  RESERVED[16];
  __IOM uint32_t  SUBSCRIBE_TRIGGER[16];        /*!< (@ 0x00000080) Description collection: Subscribe configuration
                                                                    for task TRIGGER[n]                                        */
  __IM  uint32_t  RESERVED1[16];
  __IOM uint32_t  EVENTS_TRIGGERED[16];         /*!< (@ 0x00000100) Description collection: Event number n generated
                                                                    by triggering the corresponding TRIGGER[n]
                                                                    task                                                       */
  __IM  uint32_t  RESERVED2[16];
  __IOM uint32_t  PUBLISH_TRIGGERED[16];        /*!< (@ 0x00000180) Description collection: Publish configuration
                                                                    for event TRIGGERED[n]                                     */
  __IM  uint32_t  RESERVED3[80];
  __IOM uint32_t  INTEN;                        /*!< (@ 0x00000300) Enable or disable interrupt                                */
  __IOM uint32_t  INTENSET;                     /*!< (@ 0x00000304) Enable interrupt                                           */
  __IOM uint32_t  INTENCLR;                     /*!< (@ 0x00000308) Disable interrupt                                          */
} NRF_EGU_Type;                                 /*!< Size = 780 (0x30c)                                                        */



/* =========================================================================================================================== */
/* ================                                           SWI0                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Software interrupt 0 (SWI0)
  */

typedef struct {                                /*!< (@ 0x40019000) SWI0 Structure                                             */
  __IM  uint32_t  UNUSED;                       /*!< (@ 0x00000000) Unused.                                                    */
} NRF_SWI_Type;                                 /*!< Size = 4 (0x4)                                                            */


/** @} */ /* End of group Device_Peripheral_peripherals */


/* =========================================================================================================================== */
/* ================                          Device Specific Peripheral Address Map                           ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripheralAddr
  * @{
  */

#define NRF_FICR_BASE               0x10000000UL
#define NRF_UICR_BASE               0x10001000UL
#define NRF_PAMLI_BASE              0x40020000UL
#define NRF_VMC_BASE                0x40022000UL
#define NRF_BPROT_BASE              0x40023000UL
#define NRF_NVMC_BASE               0x40023000UL
#define NRF_RAMBIST0_BASE           0x40025000UL
#define NRF_RCOSC32K_BASE           0x40027000UL
#define NRF_PCGCSLAVE_AMLI_BASE     0x41000000UL
#define NRF_PCGCMASTER0_BASE        0x41001000UL
#define NRF_CLOCK_BASE              0x40000000UL
#define NRF_POWER_BASE              0x40000000UL
#define NRF_RESET_BASE              0x40000000UL
#define NRF_AMLI_BASE               0x41000000UL
#define NRF_P0_BASE                 0x50000000UL
#define NRF_P1_BASE                 0x50000300UL
#define NRF_OSCILLATORS_BASE        0x40001000UL
#define NRF_REGULATORS_BASE         0x40001000UL
#define NRF_RADIO_BASE              0x40002000UL
#define NRF_RNG_BASE                0x40003000UL
#define NRF_GPIOTE_BASE             0x40004000UL
#define NRF_WDT_BASE                0x40005000UL
#define NRF_TIMER0_BASE             0x40006000UL
#define NRF_TIMER1_BASE             0x40007000UL
#define NRF_TIMER2_BASE             0x40008000UL
#define NRF_ECB_BASE                0x40009000UL
#define NRF_CCM_BASE                0x4000A000UL
#define NRF_AAR_BASE                0x4000A000UL
#define NRF_DPPIC_BASE              0x4000B000UL
#define NRF_RTC0_BASE               0x4000C000UL
#define NRF_RTC1_BASE               0x4000D000UL
#define NRF_SPIM0_BASE              0x4000E000UL
#define NRF_SPIS0_BASE              0x4000E000UL
#define NRF_UARTE0_BASE             0x4000E000UL
#define NRF_TWIM1_BASE              0x4000F000UL
#define NRF_TWIS1_BASE              0x4000F000UL
#define NRF_SPIM2_BASE              0x40010000UL
#define NRF_SPIS2_BASE              0x40010000UL
#define NRF_QDEC0_BASE              0x40012000UL
#define NRF_SAADC_BASE              0x40014000UL
#define NRF_EGU0_BASE               0x40017000UL
#define NRF_SWI0_BASE               0x40019000UL
#define NRF_SWI1_BASE               0x4001A000UL
#define NRF_SWI2_BASE               0x4001B000UL

/** @} */ /* End of group Device_Peripheral_peripheralAddr */


/* =========================================================================================================================== */
/* ================                                  Peripheral declaration                                   ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_declaration
  * @{
  */

#define NRF_FICR                    ((NRF_FICR_Type*)          NRF_FICR_BASE)
#define NRF_UICR                    ((NRF_UICR_Type*)          NRF_UICR_BASE)
#define NRF_PAMLI                   ((NRF_PAMLI_Type*)         NRF_PAMLI_BASE)
#define NRF_VMC                     ((NRF_VMC_Type*)           NRF_VMC_BASE)
#define NRF_BPROT                   ((NRF_BPROT_Type*)         NRF_BPROT_BASE)
#define NRF_NVMC                    ((NRF_NVMC_Type*)          NRF_NVMC_BASE)
#define NRF_RAMBIST0                ((NRF_RAMBIST_Type*)       NRF_RAMBIST0_BASE)
#define NRF_RCOSC32K                ((NRF_RCOSC32K_Type*)      NRF_RCOSC32K_BASE)
#define NRF_PCGCSLAVE_AMLI          ((NRF_PCGCSLAVE_Type*)     NRF_PCGCSLAVE_AMLI_BASE)
#define NRF_PCGCMASTER0             ((NRF_PCGCMASTER_Type*)    NRF_PCGCMASTER0_BASE)
#define NRF_CLOCK                   ((NRF_CLOCK_Type*)         NRF_CLOCK_BASE)
#define NRF_POWER                   ((NRF_POWER_Type*)         NRF_POWER_BASE)
#define NRF_RESET                   ((NRF_RESET_Type*)         NRF_RESET_BASE)
#define NRF_AMLI                    ((NRF_AMLI_Type*)          NRF_AMLI_BASE)
#define NRF_P0                      ((NRF_GPIO_Type*)          NRF_P0_BASE)
#define NRF_P1                      ((NRF_GPIO_Type*)          NRF_P1_BASE)
#define NRF_OSCILLATORS             ((NRF_OSCILLATORS_Type*)   NRF_OSCILLATORS_BASE)
#define NRF_REGULATORS              ((NRF_REGULATORS_Type*)    NRF_REGULATORS_BASE)
#define NRF_RADIO                   ((NRF_RADIO_Type*)         NRF_RADIO_BASE)
#define NRF_RNG                     ((NRF_RNG_Type*)           NRF_RNG_BASE)
#define NRF_GPIOTE                  ((NRF_GPIOTE_Type*)        NRF_GPIOTE_BASE)
#define NRF_WDT                     ((NRF_WDT_Type*)           NRF_WDT_BASE)
#define NRF_TIMER0                  ((NRF_TIMER_Type*)         NRF_TIMER0_BASE)
#define NRF_TIMER1                  ((NRF_TIMER_Type*)         NRF_TIMER1_BASE)
#define NRF_TIMER2                  ((NRF_TIMER_Type*)         NRF_TIMER2_BASE)
#define NRF_ECB                     ((NRF_ECB_Type*)           NRF_ECB_BASE)
#define NRF_CCM                     ((NRF_CCM_Type*)           NRF_CCM_BASE)
#define NRF_AAR                     ((NRF_AAR_Type*)           NRF_AAR_BASE)
#define NRF_DPPIC                   ((NRF_DPPIC_Type*)         NRF_DPPIC_BASE)
#define NRF_RTC0                    ((NRF_RTC_Type*)           NRF_RTC0_BASE)
#define NRF_RTC1                    ((NRF_RTC_Type*)           NRF_RTC1_BASE)
#define NRF_SPIM0                   ((NRF_SPIM_Type*)          NRF_SPIM0_BASE)
#define NRF_SPIS0                   ((NRF_SPIS_Type*)          NRF_SPIS0_BASE)
#define NRF_UARTE0                  ((NRF_UARTE_Type*)         NRF_UARTE0_BASE)
#define NRF_TWIM1                   ((NRF_TWIM_Type*)          NRF_TWIM1_BASE)
#define NRF_TWIS1                   ((NRF_TWIS_Type*)          NRF_TWIS1_BASE)
#define NRF_SPIM2                   ((NRF_SPIM_Type*)          NRF_SPIM2_BASE)
#define NRF_SPIS2                   ((NRF_SPIS_Type*)          NRF_SPIS2_BASE)
#define NRF_QDEC0                   ((NRF_QDEC_Type*)          NRF_QDEC0_BASE)
#define NRF_SAADC                   ((NRF_SAADC_Type*)         NRF_SAADC_BASE)
#define NRF_EGU0                    ((NRF_EGU_Type*)           NRF_EGU0_BASE)
#define NRF_SWI0                    ((NRF_SWI_Type*)           NRF_SWI0_BASE)
#define NRF_SWI1                    ((NRF_SWI_Type*)           NRF_SWI1_BASE)
#define NRF_SWI2                    ((NRF_SWI_Type*)           NRF_SWI2_BASE)

/** @} */ /* End of group Device_Peripheral_declaration */


#ifdef __cplusplus
}
#endif

#endif /* NRF5002_H */


/** @} */ /* End of group nrf5002 */

/** @} */ /* End of group Nordic Semiconductor */
